[GraphicalObject]
Name=mwd
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgmwd|dgChangeDiagHelpIndex INSTPANEL| "
Rc-DLL=hpleo008.dll

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=logbook   ,  IMAGESET   ,hpgbut02.dll
3=temp      ,  IMAGESET   ,hpgbut02.dll
4=method    ,  IMAGESET   ,hpgbut02.dll
5=vislamp   ,  IMAGESET   ,hpgbut02.dll
6=uvlamp    ,  IMAGESET   ,hpgbut02.dll
7=uslit     ,  IMAGESET   ,hpgbut02.dll
8=filter    ,  IMAGESET   ,hpgbut02.dll
9=prep      ,  PUSHBUTTON ,hpgbut02.dll

[ColorAlias]
1=blue       |  0,  0, 255


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel mwd
Help=機器パネルのトップレベルへの切替


[IMAGESET logbook]
x=455
y=14
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "MWDlogbook"|多波長検出器ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "MWDlogbook"|多波長検出器ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=


[IMAGESET temp]
x=455
y=114
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "MWDtemp"|多波長検出器温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "MWDtemp"|多波長検出器温度
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET method]
x=455
y=64
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "MWDmethod"|多波長検出器メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "MWDmethod"|多波長検出器メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET vislamp]
x=6
y=120
width=38
height=51
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgvilmp1|BMP.dgvilmp1|BMP.dgvilmp1|@view.floatingmenu "DiagGuiReg[4]", "MWDvislamp"|多波長検出器 Vis ランプ
set1= BMP.dgvilmp2|BMP.dgvilmp2|BMP.dgvilmp2|@view.floatingmenu "DiagGuiReg[4]", "MWDvislamp"|多波長検出器 Vis ランプ
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET uvlamp]
x=73
y=115
width=39
height=58
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dguvlmp1|BMP.dguvlmp1|BMP.dguvlmp1|@view.floatingmenu "DiagGuiReg[4]", "MWDuvlamp"|多波長検出器 UV ランプ
set1= BMP.dguvlmp2|BMP.dguvlmp2|BMP.dguvlmp2|@view.floatingmenu "DiagGuiReg[4]", "MWDuvlamp"|多波長検出器 UV ランプ
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET uslit]
x=291
y=122
width=21
height=49
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dguslit1|BMP.dguslit1|BMP.dguslit1|@view.floatingmenu "DiagGuiReg[4]", "MWDuslit"|多波長検出器マイクロ スリット
set1= BMP.dguslit2|BMP.dguslit2|BMP.dguslit2|@view.floatingmenu "DiagGuiReg[4]", "MWDuslit"|多波長検出器マイクロ スリット
Cursor= CUR...\..\LC\800\HAND1
Help=


[IMAGESET filter]
x=148
y=75
width=28
height=54
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgfilt1|BMP.dgfilt1|BMP.dgfilt1|@view.floatingmenu "DiagGuiReg[4]", "MWDfilter"|多波長検出器フィルタ アセンブリ
set1= BMP.dgfilt2|BMP.dgfilt2|BMP.dgfilt2|@view.floatingmenu "DiagGuiReg[4]", "MWDfilter"|多波長検出器フィルタ アセンブリ
Cursor= CUR...\..\LC\800\HAND1
Help=

[PUSHBUTTON prep]
x=425
y=10
width=15
height=15
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= RBMP.balance|RBMP.balance|RBMP.balance_gray
Command=dgMWDTurnOnOrBalance
Help=クリックで、バランスをかけるかランプをオンにします。

